scripts/bzt-artifacts/merged-1.yml
---
execution:
- concurrency: 10
  hold-for: 2m
  ramp-up: 10s
  scenario: simple
scenarios:
  simple:
    requests:
    - url: http://adi2go3c.mylabserver.com/api/ping1
    - url: http://adi2go3c.mylabserver.com/api/ping2
    - url: http://adi2go3c.mylabserver.com/api/ping3
    - url: http://adi2go3c.mylabserver.com/api/slow
    - url: http://adi2go3c.mylabserver.com/slow_randomly
    - url: http://adi2go3c.mylabserver.com/api/internal_error
    - url: http://adi2go3c.mylabserver.com/api/client_error
    think-time: 0.2
settings:
  artifacts-dir: ./bzt-artifacts