scripts/bzt-artifacts/merged.yml
---
execution:
- concurrency: 10
  hold-for: 1m
  ramp-up: 10s
  scenario: simple
scenarios:
  simple:
    requests:
    - url: http://54.206.3.178/api/ping1
    - url: http://54.206.3.178/api/ping2
    - url: http://54.206.3.178/api/ping3
    - url: http://54.206.3.178/api/slow
    - url: http://54.206.3.178/api/slow_randomly
    - url: http://54.206.3.178/api/internal_error
    - url: http://54.206.3.178/api/client_error
    think-time: 0.2
settings:
  artifacts-dir: ./bzt-artifacts